In [4]:
import xml.etree.ElementTree as ET

In [5]:
tree=ET.parse("E:/Python data/datasets-df-series/gdp-data.xml")

In [6]:
root=tree.getroot()
print(root.tag)

data

In [7]:
for child in root:
    print(child.tag)

country
country
country

In [8]:
for sub in root.find('country'):
    a=sub.attrib
    print(a)

{'updated': 'yes'}
{}
{}
{'name': 'Austria', 'direction': 'E'}
{'name': 'Switzerland', 'direction': 'W'}

In [13]:
import pandas as pd
mydict={'col1':[1,2,3,4],'col2':[5,6,7,8],'col3':['one','two','three','four']}
df=pd.DataFrame(mydict)
df

   col1  col2   col3
0     1     5    one
1     2     6    two
2     3     7  three
3     4     8   four

In [15]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [16]:
df.col1

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [19]:
df[['col1','col3']]

   col1   col3
0     1    one
1     2    two
2     3  three
3     4   four

In [21]:
df.query('col2>2')

   col1  col2   col3
0     1     5    one
1     2     6    two
2     3     7  three
3     4     8   four

In [28]:
tpl=((1001,'Ramu'),(1002,'Laxmi'),(1003,'Ganesh'))

In [31]:
df=pd.DataFrame(tpl,columns=['col1','col2'])

In [32]:
df

   col1    col2
0  1001    Ramu
1  1002   Laxmi
2  1003  Ganesh

In [36]:
df.rename(columns={'col1':'empid','col2':'empname'},inplace=True)
df

   empid empname
0   1001    Ramu
1   1002   Laxmi
2   1003  Ganesh

In [37]:
df['dept']='Sales'

In [38]:
df

   empid empname   dept
0   1001    Ramu  Sales
1   1002   Laxmi  Sales
2   1003  Ganesh  Sales

In [39]:
df['dept']=['Sales','Hr','Prod']
df

   empid empname   dept
0   1001    Ramu  Sales
1   1002   Laxmi     Hr
2   1003  Ganesh   Prod

In [40]:
df.insert(loc=1,column='Salary',value=[35000,45567,67000])
df

   empid  Salary empname   dept
0   1001   35000    Ramu  Sales
1   1002   45567   Laxmi     Hr
2   1003   67000  Ganesh   Prod

In [42]:
df['tax']=df.Salary*0.10
df

   empid  Salary empname   dept     tax
0   1001   35000    Ramu  Sales  3500.0
1   1002   45567   Laxmi     Hr  4556.7
2   1003   67000  Ganesh   Prod  6700.0

In [43]:
df1=df.assign(PF=lambda x:(x.Salary)*12.5/100)
df1

   empid  Salary empname   dept     tax        PF
0   1001   35000    Ramu  Sales  3500.0  4375.000
1   1002   45567   Laxmi     Hr  4556.7  5695.875
2   1003   67000  Ganesh   Prod  6700.0  8375.000

In [44]:
df2=df1.assign(gross=lambda x :x.Salary - x.tax -x.PF)

In [45]:
df2

   empid  Salary empname   dept     tax        PF      gross
0   1001   35000    Ramu  Sales  3500.0  4375.000  27125.000
1   1002   45567   Laxmi     Hr  4556.7  5695.875  35314.425
2   1003   67000  Ganesh   Prod  6700.0  8375.000  51925.000

In [48]:
 df2=df1.assign(Bonus=lambda x:x.Salary-x.tax+7000)

In [57]:
df2.rename(columns={'Salary':'salary'},inplace=True)

In [58]:
df2

   empid  salary empname   dept     tax        PF    Bonus
0   1001   35000    Ramu  Sales  3500.0  4375.000  38500.0
1   1002   45567   Laxmi     Hr  4556.7  5695.875  48010.3
2   1003   67000  Ganesh   Prod  6700.0  8375.000  67300.0